### Terraform Plan - `dev` Environment

<details>
<summary>Show Plan</summary>

```terraform
random_string.kv_suffix: Refreshing state... [id=7j51clw8]
random_string.appgw_suffix: Refreshing state... [id=u02liakq]
random_string.storage_suffix: Refreshing state... [id=b5xxtm3i]
data.azurerm_client_config.current: Reading...
azurerm_role_assignment.flow_logs_storage: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/65c90aa2-911a-b1ce-443f-09efb50ec550]
azurerm_user_assigned_identity.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/nsg-flow-logs-identity]
azurerm_resource_group.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01NjQwMDBmNi05NDQ3LTQ2OTktYjg3ZS1iZWIzZDA1MjliYzQ7b2JqZWN0SWQ9MTg3ZjEwMTgtZWVhNi00YWU4LWJiMWItOGNjN2ZlYzFkNWM5O3N1YnNjcmlwdGlvbklkPWRjMjJkNmQ4LTA0OTUtNDY1My1hNjliLWVkZmUxNjg0MGY4ZTt0ZW5hbnRJZD02MWE4NzQ2ZS00MjRkLTQxMDUtYTA1NC1iMzg1NzNkNmU1NGE=]
azurerm_network_watcher.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkWatchers/chatops-network-watcher]
azurerm_monitor_action_group.ops_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts]
azurerm_user_assigned_identity.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/chatops-appgw-identity]
azurerm_log_analytics_workspace.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics]
azurerm_monitor_action_group.security_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/security-alerts]
azurerm_web_application_firewall_policy.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/chatops-waf-policy]
azurerm_network_security_group.app_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg]
azurerm_storage_account.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i]
azurerm_virtual_network.chatops_vnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet]
azurerm_network_security_group.gateway_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg]
azurerm_service_plan.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan]
azurerm_public_ip.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/publicIPAddresses/chatops-appgw-pip]
azurerm_network_security_rule.allow_https_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowHTTPSInbound]
azurerm_network_security_rule.allow_gateway_manager: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowGatewayManager]
azurerm_subnet.gateway_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_subnet.app_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_network_security_rule.deny_all_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/DenyAllInbound]
azurerm_network_security_rule.allow_internet_outbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowInternetOutbound]
azurerm_network_security_rule.allow_gateway_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowGatewayInbound]
azurerm_application_insights.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/components/chatops-appinsights]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_access_anomaly: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-access-anomaly-alert]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_failed_auth: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-failed-authentication-alert]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_expiration: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-expiration-alert]
azurerm_subnet_network_security_group_association.gateway_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_subnet_network_security_group_association.app_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_key_vault.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8]
azurerm_key_vault_secret.entra_client_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/entra-client-secret/e35620c27c2246448225265dc042680b]
azurerm_key_vault_secret.bot_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-id/ddcab9583fe546a58b29ee30ace31f78]
azurerm_key_vault_secret.github_webhook_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-webhook-secret/c38ad3dabaa641a6bb95509192603d5b]
azurerm_key_vault_secret.github_app_private_key: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-private-key/0c059973e36441789f8c2c66d36f3572]
azurerm_role_assignment.appgw_kv_secrets_user: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/52b05056-9fb9-81a4-57ff-882c076fca65]
azurerm_key_vault_secret.github_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-id/d72bc82dcf674d5f855557e87753f33b]
azurerm_key_vault_secret.bot_app_password: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-password/9eca0b2ba5184787a66a774bd0f26afa]
azurerm_monitor_diagnostic_setting.kv_diagnostics: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8|kv-diagnostics]
azurerm_key_vault_certificate.appgw_ssl: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/certificates/appgw-ssl-cert/c7a3b8bf8f664306aa21b7196e0eee2e]
azurerm_application_gateway.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGateways/chatops-appgw]
azurerm_monitor_diagnostic_setting.appgw_diagnostics: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGateways/chatops-appgw|appgw-diagnostics]
azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/high-exception-rate]
azurerm_application_insights_standard_web_test.chatops_southeastasia: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia]
azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/slow-response-time]
azurerm_key_vault_secret.appinsights_connection_string: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/appinsights-connection-string/646c2e5acd6c452f85260e74591cc5fb]
azurerm_application_insights_standard_web_test.chatops_westus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus]
azurerm_application_insights_standard_web_test.chatops_eastus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-eastus]
azurerm_application_insights_standard_web_test.chatops_northeurope: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope]
azurerm_application_insights_standard_web_test.chatops_australiaeast: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast]
azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/failed-dependency]
azurerm_linux_web_app.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service]
azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/availability-test-failure]
azurerm_app_service_virtual_network_swift_connection.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service/config/virtualNetwork]
azurerm_role_assignment.kv_secrets_user_app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/b78214a8-1f48-f6e0-a32d-0748f9893376]
azurerm_monitor_diagnostic_setting.app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service|app-service-diagnostics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_app_service_virtual_network_swift_connection.chatops will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "chatops" {
      + app_service_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service"
      + id             = (known after apply)
      + subnet_id      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet"
    }

  # azurerm_application_insights_standard_web_test.chatops_australiaeast must be replaced
-/+ resource "azurerm_application_insights_standard_web_test" "chatops_australiaeast" {
      ~ geo_locations           = [
          - "emea-au-syd-edge",
          + "apac-au-syd-edge",
        ]
      ~ id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast" -> (known after apply)
      ~ location                = "eastus" -> "australiaeast" # forces replacement
        name                    = "chatops-availability-australiaeast"
      - retry_enabled           = false -> null
      ~ synthetic_monitor_id    = "chatops-availability-australiaeast" -> (known after apply)
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "TestRegion"  = "australiaeast"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_northeurope must be replaced
-/+ resource "azurerm_application_insights_standard_web_test" "chatops_northeurope" {
      ~ id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope" -> (known after apply)
      ~ location                = "eastus" -> "northeurope" # forces replacement
        name                    = "chatops-availability-northeurope"
      - retry_enabled           = false -> null
      ~ synthetic_monitor_id    = "chatops-availability-northeurope" -> (known after apply)
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "TestRegion"  = "northeurope"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_southeastasia must be replaced
-/+ resource "azurerm_application_insights_standard_web_test" "chatops_southeastasia" {
      ~ id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia" -> (known after apply)
      ~ location                = "eastus" -> "southeastasia" # forces replacement
        name                    = "chatops-availability-southeastasia"
      - retry_enabled           = false -> null
      ~ synthetic_monitor_id    = "chatops-availability-southeastasia" -> (known after apply)
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "TestRegion"  = "southeastasia"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_westus must be replaced
-/+ resource "azurerm_application_insights_standard_web_test" "chatops_westus" {
      ~ id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus" -> (known after apply)
      ~ location                = "eastus" -> "westus" # forces replacement
        name                    = "chatops-availability-westus"
      - retry_enabled           = false -> null
      ~ synthetic_monitor_id    = "chatops-availability-westus" -> (known after apply)
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "TestRegion"  = "westus"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_key_vault.chatops will be updated in-place
  ~ resource "azurerm_key_vault" "chatops" {
        id                              = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
        name                            = "chatops-kv-7j51clw8"
        tags                            = {
            "Application" = "ChatOps"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Allow" -> "Deny"
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_linux_web_app.chatops will be updated in-place
  ~ resource "azurerm_linux_web_app" "chatops" {
      ~ app_settings                                   = {
          + "WEBSITE_NODE_DEFAULT_VERSION"               = "18-lts"
            # (7 unchanged elements hidden)
        }
        id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service"
        name                                           = "chatops-app-service"
      ~ tags                                           = {
            "Application"                            = "ChatOps"
            "CostCenter"                             = "IT-Operations"
            "Environment"                            = "dev"
            "ManagedBy"                              = "Terraform"
            "Owner"                                  = "ChatOps-Team"
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/microsoft.insights/components/chatops-appinsights" -> null
        }
        # (20 unchanged attributes hidden)

      ~ site_config {
          ~ always_on                               = false -> true
            # (24 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_autoscale_setting.chatops_app_plan will be created
  + resource "azurerm_monitor_autoscale_setting" "chatops_app_plan" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "chatops-app-plan-autoscale"
      + resource_group_name = "rg-chatops-dev"
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + target_resource_id  = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"

      + notification {
          + email {
              + custom_emails                         = [
                  + "ops-team@company.com",
                ]
              + send_to_subscription_administrator    = false
              + send_to_subscription_co_administrator = false
            }
        }

      + profile {
          + name = "default"

          + capacity {
              + default = 1
              + maximum = 5
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_resource_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 75
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_resource_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 25
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_resource_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 85
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "MemoryPercentage"
                  + metric_resource_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 30
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "availability_test_failure" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/availability-test-failure"
        name                                   = "availability-test-failure"
        tags                                   = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (15 unchanged attributes hidden)

      ~ criteria {
          - metric_measure_column   = "FailedRegions" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "high_exception_rate" {
      ~ evaluation_frequency                   = "PT5M" -> "PT1M"
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/high-exception-rate"
        name                                   = "high-exception-rate"
        tags                                   = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "slow_response_time" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/slow-response-time"
        name                                   = "slow-response-time"
        tags                                   = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (15 unchanged attributes hidden)

      ~ criteria {
          - metric_measure_column   = "AvgDuration" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.flow_logs_storage will be destroyed
  # (because azurerm_role_assignment.flow_logs_storage is not in configuration)
  - resource "azurerm_role_assignment" "flow_logs_storage" {
      - id                   = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/65c90aa2-911a-b1ce-443f-09efb50ec550" -> null
      - name                 = "65c90aa2-911a-b1ce-443f-09efb50ec550" -> null
      - principal_id         = "9710b09b-0f7d-452b-a269-e286242728f7" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i" -> null
    }

  # azurerm_service_plan.chatops will be updated in-place
  ~ resource "azurerm_service_plan" "chatops" {
        id                           = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan"
        name                         = "chatops-app-plan"
      ~ sku_name                     = "FC1" -> "P1v3"
        tags                         = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_subnet.app_subnet will be updated in-place
  ~ resource "azurerm_subnet" "app_subnet" {
        id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet"
        name                                           = "app-subnet"
      ~ service_endpoints                              = [
          - "Microsoft.KeyVault",
        ]
        # (10 unchanged attributes hidden)

      ~ delegation {
            name = "app-service-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              ~ name    = "Microsoft.App/environments" -> "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_user_assigned_identity.nsg_flow_logs will be destroyed
  # (because azurerm_user_assigned_identity.nsg_flow_logs is not in configuration)
  - resource "azurerm_user_assigned_identity" "nsg_flow_logs" {
      - client_id           = "f1898e99-ae61-4b85-b583-08f87e2ccbc2" -> null
      - id                  = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/nsg-flow-logs-identity" -> null
      - location            = "eastus" -> null
      - name                = "nsg-flow-logs-identity" -> null
      - principal_id        = "9710b09b-0f7d-452b-a269-e286242728f7" -> null
      - resource_group_name = "rg-chatops-dev" -> null
      - tags                = {
          - "Application" = "ChatOps"
          - "Environment" = "dev"
          - "ManagedBy"   = "Terraform"
        } -> null
      - tenant_id           = "61a8746e-424d-4105-a054-b38573d6e54a" -> null
    }

  # azurerm_web_application_firewall_policy.chatops will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "chatops" {
        id                  = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/chatops-waf-policy"
        name                = "chatops-waf-policy"
        tags                = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "Purpose"     = "WAF Protection"
        }
        # (4 unchanged attributes hidden)

      + custom_rules {
          + action               = "Block"
          + enabled              = true
          + name                 = "RateLimitRule"
          + priority             = 1
          + rate_limit_duration  = "OneMin"
          + rate_limit_threshold = 100
          + rule_type            = "RateLimitRule"

          + match_conditions {
              + match_values       = [
                  + "0.0.0.0/0",
                  + "::/0",
                ]
              + negation_condition = false
              + operator           = "IPMatch"

              + match_variables {
                  + variable_name = "RemoteAddr"
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 8 to change, 6 to destroy.

Changes to Outputs:
  ~ availability_test_australiaeast_id           = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast" -> (known after apply)
  ~ availability_test_northeurope_id             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope" -> (known after apply)
  ~ availability_test_southeastasia_id           = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia" -> (known after apply)
  ~ availability_test_westus_id                  = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus" -> (known after apply)

Error: retrieving queue properties for Storage Account (Subscription: "dc22d6d8-0495-4653-a69b-edfe16840f8e"
Resource Group Name: "rg-chatops-dev"
Storage Account Name: "chatopsnsgflowb5xxtm3i"): executing request: unexpected status 403 (403 Key based authentication is not permitted on this storage account.) with KeyBasedAuthenticationNotPermitted: Key based authentication is not permitted on this storage account.
RequestId:14c3be4e-8003-0069-411b-79d819000000
Time:2025-12-29T23:36:06.5213685Z

  with azurerm_storage_account.nsg_flow_logs,
  on network.tf line 278, in resource "azurerm_storage_account" "nsg_flow_logs":
 278: resource "azurerm_storage_account" "nsg_flow_logs" {


```

</details>

*Pusher: @Copilot, Action: `pull_request`, Workflow: `Infrastructure - PR Validation`*